Repository: StanfordSpezi/SpeziLLM
Catalog: Sources/SpeziOpenAI/Resources/Localizable.xcstrings
Source language: en
Languages: de, es

source: Message Input Textfield
de: Nachrichteneingabefeld
es: Campo de texto de entrada de mensaje

# MICROPHONE_BUTTON
source: Record Message
de: Nachricht aufnehmen
es: Grabar Mensaje

# OPENAI_API_KEY_PROMPT
source: OpenAI API Key
de: OpenAI-API-Schlüssel
es: Clave API de OpenAI

# OPENAI_API_KEY_SAVE_BUTTON
source: Next
de: Weiter
es: Siguiente

# OPENAI_API_KEY_SUBTITLE
source: Please enter your OpenAI API key.
de: Bitte geben Sie Ihren OpenAI-API-Schlüssel ein.
es: Por favor, introduzca su clave API de OpenAI.

# OPENAI_API_KEY_SUBTITLE_HINT
source: You can create and inspect your OpenAI API keys [in the API keys section of your OpenAI Account](https://platform.openai.com/account/api-keys).
de: Sie können Ihre OpenAI-API-Schlüssel [im API-Schlüsselbereich Ihres OpenAI-Kontos erstellen und überprüfen.](https://platform.openai.com/account/api-keys)
es: Puede crear e inspeccionar sus claves API de OpenAI [en la sección de claves API de su cuenta de OpenAI.](https://platform.openai.com/account/api-keys)

# OPENAI_API_KEY_TITLE
source: OpenAI API Key
de: OpenAI-API-Schlüssel
es: Clave API de OpenAI

# OPENAI_MODEL_SELECTION_DESCRIPTION
source: OpenAI GPT Model
de: OpenAI GPT-Modell
es: Modelo GPT de OpenAI

# OPENAI_MODEL_SELECTION_SAVE_BUTTON
source: Next
de: Weiter
es: Siguiente

# OPENAI_MODEL_SELECTION_SUBTITLE
source: Select the OpenAI model that you want to use. Ensure that your API key has proper access to the model you select.
de: Wählen Sie das OpenAI-Modell, das Sie verwenden möchten. Stellen Sie sicher, dass Ihr API-Schlüssel angemessenen Zugriff auf das ausgewählte Modell hat.
es: Seleccione el modelo de OpenAI que desea utilizar. Asegúrese de que su clave API tenga acceso adecuado al modelo que seleccione.

# OPENAI_MODEL_SELECTION_TITLE
source: Select an OpenAI Model
de: Wählen Sie ein OpenAI-Modell
es: Seleccione un Modelo de OpenAI

source: Send Message
de: Nachricht senden
es: Enviar Mensaje
